nxp-mcuxpresso/mcux-soc-svd/LPC54101/LPC54101.xml
        <register>
          <name>CFSR</name>
          <description>Configurable Fault Status Registers</description>
          <addressOffset>0xD28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IACCVIOL</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IACCVIOL_0</name>
                  <description>no instruction access violation fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IACCVIOL_1</name>
                  <description>the processor attempted an instruction fetch from a location that does not permit execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACCVIOL</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACCVIOL_0</name>
                  <description>no data access violation fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCVIOL_1</name>
                  <description>the processor attempted a load or store at a location that does not permit the operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUNSTKERR</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUNSTKERR_0</name>
                  <description>no unstacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUNSTKERR_1</name>
                  <description>unstack for an exception return has caused one or more access violations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTKERR</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSTKERR_0</name>
                  <description>no stacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSTKERR_1</name>
                  <description>stacking for an exception entry has caused one or more access violations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MLSPERR</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MLSPERR_0</name>
                  <description>No MemManage fault occurred during floating-point lazy state preservation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MLSPERR_1</name>
                  <description>A MemManage fault occurred during floating-point lazy state preservation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMARVALID</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MMARVALID_0</name>
                  <description>value in MMAR is not a valid fault address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMARVALID_1</name>
                  <description>MMAR holds a valid fault address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBUSERR</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBUSERR_0</name>
                  <description>no instruction bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBUSERR_1</name>
                  <description>instruction bus error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRECISERR</name>
              <description>no description available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRECISERR_0</name>
                  <description>no precise data bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISERR_1</name>
                  <description>a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMPRECISERR</name>
              <description>no description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMPRECISERR_0</name>
                  <description>no imprecise data bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMPRECISERR_1</name>
                  <description>a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTKERR</name>
              <description>no description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSTKERR_0</name>
                  <description>no unstacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNSTKERR_1</name>
                  <description>unstack for an exception return has caused one or more BusFaults</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STKERR</name>
              <description>no description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STKERR_0</name>
                  <description>no stacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STKERR_1</name>
                  <description>stacking for an exception entry has caused one or more BusFaults</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSPERR</name>
              <description>no description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSPERR_0</name>
                  <description>No bus fault occurred during floating-point lazy state preservation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSPERR_1</name>
                  <description>A bus fault occurred during floating-point lazy state preservation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFARVALID</name>
              <description>no description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFARVALID_0</name>
                  <description>value in BFAR is not a valid fault address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFARVALID_1</name>
                  <description>BFAR holds a valid fault address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNDEFINSTR</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNDEFINSTR_0</name>
                  <description>no undefined instruction UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINSTR_1</name>
                  <description>the processor has attempted to execute an undefined instruction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVSTATE</name>
              <description>no description available</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVSTATE_0</name>
                  <description>no invalid state UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVSTATE_1</name>
                  <description>the processor has attempted to execute an instruction that makes illegal use of the EPSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVPC</name>
              <description>no description available</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVPC_0</name>
                  <description>no invalid PC load UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVPC_1</name>
                  <description>the processor has attempted an illegal load of EXC_RETURN to the PC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOCP</name>
              <description>no description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCP_0</name>
                  <description>no UsageFault caused by attempting to access a coprocessor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCP_1</name>
                  <description>the processor has attempted to access a coprocessor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNALIGNED</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNALIGNED_0</name>
                  <description>no unaligned access fault, or unaligned access trapping not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNALIGNED_1</name>
                  <description>the processor has made an unaligned memory access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVBYZERO</name>
              <description>no description available</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVBYZERO_0</name>
                  <description>no divide by zero fault, or divide by zero trapping not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBYZERO_1</name>
                  <description>the processor has executed an SDIV or UDIV instruction with a divisor of 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFSR</name>
          <description>HardFault Status register</description>
          <addressOffset>0xD2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VECTTBL</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VECTTBL_0</name>
                  <description>no BusFault on vector table read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VECTTBL_1</name>
                  <description>BusFault on vector table read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCED</name>
              <description>no description available</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCED_0</name>
                  <description>no forced HardFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCED_1</name>
                  <description>forced HardFault</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUGEVT</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSR</name>
          <description>Debug Fault Status Register</description>
          <addressOffset>0xD30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HALTED</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALTED_0</name>
                  <description>No active halt request debug event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALTED_1</name>
                  <description>Halt request debug event active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BKPT</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BKPT_0</name>
                  <description>No current breakpoint debug event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BKPT_1</name>
                  <description>At least one current breakpoint debug event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWTTRAP</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DWTTRAP_0</name>
                  <description>No current debug events generated by the DWT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWTTRAP_1</name>
                  <description>At least one current debug event generated by the DWT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCATCH</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VCATCH_0</name>
                  <description>No Vector catch triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCATCH_1</name>
                  <description>Vector catch triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTERNAL</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTERNAL_0</name>
                  <description>No EDBGRQ debug event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_1</name>
                  <description>EDBGRQ debug event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMFAR</name>
          <description>MemManage Address Register</description>
          <addressOffset>0xD34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of MemManage fault location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
